DiavgeiaJava/request.xml

<soapenv:Envelope xmlns:soapenv= "http://schemas.xmlsoap.org/soap/envelope/" xmlns:rgw= "http://gr/gsis/rgwsbasstoixn/RgWsBasStoixN.wsdl" xmlns:typ= "http://gr/gsis/rgwsbasstoixn/RgWsBasStoixN.wsdl/types/" xmlns:xsi= "http://www.w3.org/2001/XMLSchema-instance" ><soapenv:Header/><soapenv:Body><rgw:rgWsBasStoixEpit><pAfm xsi:type="xsd:string">998281207</pAfm><pBasStoixEpitRec_out> <typ:residenceParDescription></typ:residenceParDescription><typ:assTxpActualAfm></typ:assTxpActualAfm> <typ:actLongDescr></typ:actLongDescr> <typ:postalZipCode></typ:postalZipCode> <typ:INiFlagDescr></typ:INiFlagDescr><typ:registDate>2011-01-01</typ:registDate> <typ:stopDate>2011-01-01</typ:stopDate><typ:parDescription></typ:parDescription><typ:doyDescr></typ:doyDescr> <typ:residenceZipCode></typ:residenceZipCode><typ:deactivationFlagDescr></typ:deactivationFlagDescr> <typ:legalStatusDescr></typ:legalStatusDescr> <typ:firmPhone></typ:firmPhone> <typ:firmFax></typ:firmFax> <typ:afm></typ:afm><typ:facActivity>0</typ:facActivity> <typ:countOfBranches>0</typ:countOfBranches><typ:deactivationFlag>1</typ:deactivationFlag><typ:postalAddressNo></typ:postalAddressNo> <typ:firmFlagDescr></typ:firmFlagDescr> <typ:postalAddress></typ:postalAddress> <typ:doy></typ:doy> <typ:onomasia></typ:onomasia> <typ:commerTitle></typ:commerTitle> </pBasStoixEpitRec_out><pCallSeqId_out>0</pCallSeqId_out><pErrorRec_out> <typ:errorDescr></typ:errorDescr> <typ:errorCode></typ:errorCode></pErrorRec_out></rgw:rgWsBasStoixEpit></soapenv:Body> </soapenv:Envelope>
