res/raw/gsisrequesttemplate.xml

<?xml version="1.0" encoding="utf-8"?>

<!--
	Licensed to the Apache Software Foundation (ASF) under one
    or more contributor license agreements.  See the NOTICE file
    distributed with this work for additional information
    regarding copyright ownership.  The ASF licenses this file
    to you under the Apache License, Version 2.0 (the
    "License"); you may not use this file except in compliance
    with the License.  You may obtain a copy of the License at

      http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing,
    software distributed under the License is distributed on an
    "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
    KIND, either express or implied.  See the License for the
    specific language governing permissions and limitations
    under the License.
-->

<soapenv:Envelope xmlns:soapenv= "http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:rgw= "http://gr/gsis/rgwsbasstoixn/RgWsBasStoixN.wsdl" 
xmlns:typ= "http://gr/gsis/rgwsbasstoixn/RgWsBasStoixN.wsdl/types/" 
xmlns:xsi= "http://www.w3.org/2001/XMLSchema-instance" > 
   <soapenv:Header/> 
   <soapenv:Body> 
      <rgw:rgWsBasStoixN> 
         <pAfm xsi:type="xsd:string">%s</pAfm> 
         <pBasStoixNRec_out> 
            <typ:actLongDescr></typ:actLongDescr> 
            <typ:postalZipCode></typ:postalZipCode> 
            <typ:facActivity>0</typ:facActivity> 
            <typ:registDate>2011-01-01</typ:registDate> 
            <typ:stopDate>2011-01-01</typ:stopDate> 
            <typ:doyDescr></typ:doyDescr> 
            <typ:parDescription></typ:parDescription> 
            <typ:deactivationFlag>1</typ:deactivationFlag> 
            <typ:postalAddressNo></typ:postalAddressNo> 
            <typ:postalAddress></typ:postalAddress> 
            <typ:doy></typ:doy> 
            <typ:firmPhone></typ:firmPhone> 
            <typ:onomasia></typ:onomasia> 
            <typ:firmFax></typ:firmFax> 
            <typ:afm></typ:afm> 
            <typ:commerTitle></typ:commerTitle> 
         </pBasStoixNRec_out> 
         <pCallSeqId_out>0</pCallSeqId_out> 
         <pErrorRec_out> 
            <typ:errorDescr></typ:errorDescr> 
            <typ:errorCode></typ:errorCode> 
         </pErrorRec_out> 
      </rgw:rgWsBasStoixN> 
   </soapenv:Body> 
</soapenv:Envelope>